using System;

class Program
{
    static void Main()
    {
        // Задана точність
        const double eps = 0.000001;
        double sum = 0;  // Сума членів ряду
        double term;     // Поточний член ряду
        long n = 0;      // Номер члена ряду

        // Основний цикл
        while (true)
        {
            // Обчислення чергового члена ряду
            term = Math.Pow(-1, n) * (n + 1) / (Math.Pow(n, 3) + 1);

            // Перевірка досягнення межі точності
            if (Math.Abs(term) >= eps)
            {
                sum += term;  // Накопичення суми
            }
            else
            {
                break;  // Вихід з циклу, якщо досягнуто точності
            }

            // Якщо враховано 10 членів ряду, виведення суми
            if (n == 9)
            {
                Console.WriteLine($"Сума 10-ти членів ряду = {sum:F7}");
            }

            n++;  // Переходимо до наступного члена ряду
        }

        // Виведення остаточного значення суми
        Console.WriteLine($"Повна сума ряду = {sum:F7}");
    }
}
